balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA110.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPD3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPD3" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PDE" edc:desc="" edc:mask="0x1" edc:name="CN32PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN33PDE" edc:desc="" edc:mask="0x1" edc:name="CN33PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN34PDE" edc:desc="" edc:mask="0x1" edc:name="CN34PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN35PDE" edc:desc="" edc:mask="0x1" edc:name="CN35PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN36PDE" edc:desc="" edc:mask="0x1" edc:name="CN36PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN37PDE" edc:desc="" edc:mask="0x1" edc:name="CN37PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN38PDE" edc:desc="" edc:mask="0x1" edc:name="CN38PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN39PDE" edc:desc="" edc:mask="0x1" edc:name="CN39PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN40PDE" edc:desc="" edc:mask="0x1" edc:name="CN40PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN41PDE" edc:desc="" edc:mask="0x1" edc:name="CN41PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN42PDE" edc:desc="" edc:mask="0x1" edc:name="CN42PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN43PDE" edc:desc="" edc:mask="0x1" edc:name="CN43PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN44PDE" edc:desc="" edc:mask="0x1" edc:name="CN44PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN45PDE" edc:desc="" edc:mask="0x1" edc:name="CN45PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN46PDE" edc:desc="" edc:mask="0x1" edc:name="CN46PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN47PDE" edc:desc="" edc:mask="0x1" edc:name="CN47PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPD4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPD4" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN48PDE" edc:desc="" edc:mask="0x1" edc:name="CN48PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN49PDE" edc:desc="" edc:mask="0x1" edc:name="CN49PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PDE" edc:desc="" edc:mask="0x1" edc:name="CN50PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PDE" edc:desc="" edc:mask="0x1" edc:name="CN51PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PDE" edc:desc="" edc:mask="0x1" edc:name="CN52PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PDE" edc:desc="" edc:mask="0x1" edc:name="CN53PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PDE" edc:desc="" edc:mask="0x1" edc:name="CN54PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PDE" edc:desc="" edc:mask="0x1" edc:name="CN55PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PDE" edc:desc="" edc:mask="0x1" edc:name="CN56PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57PDE" edc:desc="" edc:mask="0x1" edc:name="CN57PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58PDE" edc:desc="" edc:mask="0x1" edc:name="CN58PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PDE" edc:desc="" edc:mask="0x1" edc:name="CN59PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PDE" edc:desc="" edc:mask="0x1" edc:name="CN60PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PDE" edc:desc="" edc:mask="0x1" edc:name="CN61PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PDE" edc:desc="" edc:mask="0x1" edc:name="CN62PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PDE" edc:desc="" edc:mask="0x1" edc:name="CN63PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPD5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000xx00000000" edc:name="CNPD5" edc:nzwidth="0x10" edc:por="000000xx00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PDE" edc:desc="" edc:mask="0x1" edc:name="CN64PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PDE" edc:desc="" edc:mask="0x1" edc:name="CN65PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN66PDE" edc:desc="" edc:mask="0x1" edc:name="CN66PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN67PDE" edc:desc="" edc:mask="0x1" edc:name="CN67PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN68PDE" edc:desc="" edc:mask="0x1" edc:name="CN68PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PDE" edc:desc="" edc:mask="0x1" edc:name="CN69PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PDE" edc:desc="" edc:mask="0x1" edc:name="CN70PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PDE" edc:desc="" edc:mask="0x1" edc:name="CN71PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72PDE" edc:desc="" edc:mask="0x1" edc:name="CN72PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN73PDE" edc:desc="" edc:mask="0x1" edc:name="CN73PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN74PDE" edc:desc="" edc:mask="0x1" edc:name="CN74PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN75PDE" edc:desc="" edc:mask="0x1" edc:name="CN75PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN76PDE" edc:desc="" edc:mask="0x1" edc:name="CN76PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN77PDE" edc:desc="" edc:mask="0x1" edc:name="CN77PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN78PDE" edc:desc="" edc:mask="0x1" edc:name="CN78PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN79PDE" edc:desc="" edc:mask="0x1" edc:name="CN79PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="CNPD6" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000xx000" edc:name="CNPD6" edc:nzwidth="0x10" edc:por="00000000000xx000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN80PDE" edc:desc="" edc:mask="0x1" edc:name="CN80PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN81PDE" edc:desc="" edc:mask="0x1" edc:name="CN81PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN82PDE" edc:desc="" edc:mask="0x1" edc:name="CN82PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN83PDE" edc:desc="" edc:mask="0x1" edc:name="CN83PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN84PDE" edc:desc="" edc:mask="0x1" edc:name="CN84PDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
